Table of Contents
 Class BondedTendon
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Bonded tendon
[OpenModelClass("CI.StructModel.Structure.BondedTendon,CI.StructuralElements", "CI.StructModel.Structure.IBondedTendon,CI.BasicTypes", typeof(Tendon))]
public class BondedTendon : Tendon
Inheritance
object
OpenObject
OpenElementId
Tendon
BondedTendon
Inherited Members
 Tendon.Material
 Tendon.NumberOfStrand
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 BondedTendon()
Constructor
public BondedTendon()
Properties
 Geometry
Geometry
public Polygon3D Geometry { get; set; }
Property Value
Polygon3D
 Edit this page